fonecmid-diplom/src/DataProcessors/ВКМ_МассовоеСозданиеАктов.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<DataProcessor>
		<Properties>
			<Name>ВКМ_МассовоеСозданиеАктов</Name>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Период</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>СписокДоговоров</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>ТЧ_Договор</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ДоговорыКонтрагентов</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ТЧ_Реализация</Name>
							<Type>
								<v8:Type>cfg:DocumentRef.РеализацияТоваровУслуг</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</DataProcessor>
</MetaDataObject>

fonecmid-diplom/src/Documents/РеализацияТоваровУслуг.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Document>
		<Properties>
			<Name>РеализацияТоваровУслуг</Name>
			<Posting>Allow</Posting>
			<RegisterRecords>
				<xr:Item>AccumulationRegister.ОстаткиТоваров</xr:Item>
				<xr:Item>AccumulationRegister.ОбработкаЗаказов</xr:Item>
				<xr:Item>AccumulationRegister.Продажи</xr:Item>
			</RegisterRecords>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Контрагент</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Договор</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ДоговорыКонтрагентов</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СуммаДокумента</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Основание</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.ЗаказПокупателя</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Ответственный</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>Товары</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Номенклатура</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Количество</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>10</v8:Digits>
									<v8:FractionDigits>0</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Цена</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Сумма</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>Услуги</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Номенклатура</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Количество</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>10</v8:Digits>
									<v8:FractionDigits>0</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Цена</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Сумма</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Document>
</MetaDataObject>

fonecmid-diplom/src/DataProcessors/ВКМ_МассовоеСозданиеАктов/Ext/ManagerModule.bsl
#Область ПрограммныйИнтерфейс

Процедура ВыполнитьСоздание(Параметры, АдресРезультата) Экспорт
	
	Период = Параметры.Период; 
	МассивДоговоров = Параметры.МассивДоговоров;
	
	Для Каждого ТекДоговор Из МассивДоговоров Цикл
		
		// 1. Повторная проверка: вдруг кто-то уже создал документ, пока мы думали
		Если СуществуетДокументЗаПериод(ТекДоговор, Период) Тогда
			Продолжить;
		КонецЕсли;
		
		Попытка
			
			// 2. Создание нового документа
			НовыйДокумент = Документы.РеализацияТоваровУслуг.СоздатьДокумент();
			НовыйДокумент.Дата = КонецМесяца(Период); // Обычно акты делают концом месяца
			
			// 3. Стандартное заполнение (Заполнение шапки)
			ДанныеЗаполнения = Новый Структура("Договор", ТекДоговор);
			НовыйДокумент.Заполнить(ДанныеЗаполнения);
			
			// Явное присвоение, если стандартное заполнение не справилось с шапкой
			НовыйДокумент.Договор = ТекДоговор;
			НовыйДокумент.Контрагент = ТекДоговор.Владелец; // Владелец договора - это контрагент
			НовыйДокумент.Организация = ТекДоговор.Организация;
			
			// 4. Метод модуля объекта: ВыполнитьАвтозаполнение (из задания)
			НовыйДокумент.ВыполнитьАвтозаполнение();
			
			// 5. Проверка заполнения (Стандартный механизм)
			Если НЕ НовыйДокумент.ПроверитьЗаполнение() Тогда
				// Если есть ошибки заполнения, документ записываем непроведенным
				НовыйДокумент.Записать(РежимЗаписиДокумента.Запись);
			Иначе
				// 6. Проведение
				НовыйДокумент.Записать(РежимЗаписиДокумента.Проведение);
			КонецЕсли;
			
		Исключение
			// Логируем ошибку в Журнал Регистрации, чтобы фоновое задание не падало целиком
			ЗаписьЖурналаРегистрации("ВКМ_МассовоеСоздание", УровеньЖурналаРегистрации.Ошибка, , ТекДоговор, ОписаниеОшибки());
		КонецПопытки;
		
	КонецЦикла;

КонецПроцедуры

#КонецОбласти


#Область СлужебныеПроцедурыИФункции

// Функция проверяет, есть ли уже Реализация по этому договору в указанном месяце
Функция СуществуетДокументЗаПериод(Договор, Период)
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ ПЕРВЫЕ 1
		|	РеализацияТоваровУслуг.Ссылка КАК Ссылка
		|ИЗ
		|	Документ.РеализацияТоваровУслуг КАК РеализацияТоваровУслуг
		|ГДЕ
		|	РеализацияТоваровУслуг.Договор = &Договор
		|	И РеализацияТоваровУслуг.Дата МЕЖДУ &НачалоПериода И &КонецПериода
		|	И НЕ РеализацияТоваровУслуг.ПометкаУдаления";
	
	Запрос.УстановитьПараметр("Договор", Договор);
	Запрос.УстановитьПараметр("НачалоПериода", НачалоМесяца(Период));
	Запрос.УстановитьПараметр("КонецПериода", КонецМесяца(Период));
	
	Результат = Запрос.Выполнить();
	
	// Если запрос вернул хотя бы одну строку, значит документ уже есть
	Возврат НЕ Результат.Пустой();
	
КонецФункции

#КонецОбласти
